#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.snowflake_resources.snowflake_database_role.owner will be created
  + resource "snowflake_database_role" "owner" {
      + database             = "TEST_PROD"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_TEST_PROD_FIRST_TF_SCHEMA_O"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_database_role.read will be created
  + resource "snowflake_database_role" "read" {
      + database             = "TEST_PROD"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_TEST_PROD_FIRST_TF_SCHEMA_R"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_database_role.read_write will be created
  + resource "snowflake_database_role" "read_write" {
      + database             = "TEST_PROD"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ROLE_TEST_PROD_FIRST_TF_SCHEMA_RW"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_grant_database_role.o_inherits_rw will be created
  + resource "snowflake_grant_database_role" "o_inherits_rw" {
      + database_role_name = "\"TEST_PROD\".\"ROLE_TEST_PROD_FIRST_TF_SCHEMA_O\""
      + id                 = (known after apply)
      + parent_role_name   = "\"TEST_PROD\".\"ROLE_TEST_PROD_FIRST_TF_SCHEMA_RW\""
    }

  # module.snowflake_resources.snowflake_grant_database_role.rw_inherits_r will be created
  + resource "snowflake_grant_database_role" "rw_inherits_r" {
      + database_role_name = "\"TEST_PROD\".\"ROLE_TEST_PROD_FIRST_TF_SCHEMA_RW\""
      + id                 = (known after apply)
      + parent_role_name   = "\"TEST_PROD\".\"ROLE_TEST_PROD_FIRST_TF_SCHEMA_R\""
    }

  # module.snowflake_resources.snowflake_grant_privileges_to_database_role.usage_to_r will be created
  + resource "snowflake_grant_privileges_to_database_role" "usage_to_r" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "\"TEST_PROD\".\"ROLE_TEST_PROD_FIRST_TF_SCHEMA_R\""
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "\"TEST_PROD\".\"FIRST_TF_SCHEMA\""
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Abhinandan90, Action: `pull_request`*